Repository: rkward-community/rkwarddev
Catalog: inst/rkward/po/rkward__CreateRKWardpluginscript_rkward.*.po
Languages: uk

# NAME OF TRANSLATORS
source: Your names
uk: Юрій Чорноіван

# EMAIL OF TRANSLATORS
source: Your emails
uk: yurchor@ukr.net

source: RKWard Plugin Script
uk: Скрипт додатка RKWard

source: GUI interface to create RKWard plugin skeletons via rkwarddev scripts
uk: Графічний інтерфейс для створення каркасів додатків RKWard за допомогою скриптів rkwarddev

source: Create RKWard plugin script
uk: Створити скрипт додатка RKWard

source: Generate a plugin skeleton for RKWard via rkwarddev scripts.
uk: Створити каркас додатка до RKWard за допомогою скриптів rkwarddev.

source: This plugin is both, an example for a plugin written with the rkwarddev package, and a quick way to get an rkwarddev script for new plugins.
uk: Цей додаток є одночасно прикладом додатка, створеного за допомогою пакунка rkwarddev, і графічним інтерфейсом для доступу до скриптів rkwarddev для створення додатків.

source: Give the name for your new plugin here.
uk: Тут вам слід вказати назву вашого нового додатка.

source: Define the license for your plugin. A short form should be sufficient.
uk: Вкажіть умови ліцензування вашого додатка. Запису у скороченій формі буде достатньо.

source: Describe your plugin in a few sentences: What does it do?
uk: Опишіть ваш додаток у декількох реченнях: для чого його призначено?

source: Version information for your plugin.
uk: Дані щодо версії вашого додатка.

source: The release date of your plugin. If you leave this empty, the current date will be used automatically.
uk: Дата випуску вашого додатка. Якщо ви не вкажете дати, автоматично буде використано поточну дату.

source: A URL where one can find more information on the plugin, download updates etc.
uk: Адреса, за якою можна знайти докладнішу інформацію щодо додатка, отримати оновлення тощо.

source: A category for your plugin. This information is currently ignored by RKWard.
uk: Категорія вашого додатка. У поточній версії RKWard ці відомості ні на що не впливають.

source: First name of the package author.
uk: Ім’я автора пакунка.

source: Family name of the package author.
uk: Прізвище автора пакунка.

source: The authors e-mail address, important for bug reports and receiving a myriad of thank yous...
uk: Адреса електронної пошти авторів, важлива для повідомлень про вади і отримання незлічених подяк…

source: Check this if this person is the author of the plugin code.
uk: Позначте цей пункт, якщо ця особа є автором коду пакунка.

source: Check this if this person maintains the plugin package.
uk: Позначте цей пункт, якщо ця особа є супровідником пакунка додатка.

source: Check this if this person is a contributor to the plugin code (e.g., translations).
uk: Позначте цей пункт, якщо ця особа є учасником розробки коду пакунка (наприклад, є перекладачем).

source: Set the directory where all plugin files and its directory structure should be generated. The default is a temporary directory.
uk: Вкажіть каталог, у якому має бути створено усі файли та структуру каталогів додатка. Типовим є тимчасовий каталог.

source: If this is checked, existing files in the specified target directory will probably be replaced by new ones.
uk: Якщо позначено цей пункт, наявні файли у вказаному каталозі призначення буде замінено новими.

source: If this is checked, a wizard section will be included in the skeleton.
uk: Якщо позначено цей пункт, до каркасу пакунка буде включено розділ майстра.

source: If this is checked, plugin tests will be included in the skeleton.
uk: Якщо позначено цей пункт, до каркасу пакунка буде включено тести.

source: If this is checked, the generated plugin will be shown (opened) for you to see what it looks like.
uk: Якщо буде позначено цей пункт, програма відкриє створений додаток для показу.

source: If this is checked, all generated files will be opened for editing instantly.
uk: Якщо позначено цей пункт, усі створені файли буде негайно відкрито для редагування.

source: If this is checked, the generated plugin will automatically be registered in RKWard's configuration. If you store it in a temporary directory and remove it before the next start of RKWard, the entry will removed again as well.
uk: Якщо позначено цей пункт, створений додаток буде автоматично зареєстровано у налаштуваннях RKWard. Якщо ви збережете додаток до тимчасового каталогу і вилучите його до наступного запуску RKWard, запис у налаштуваннях також буде вилучено.

source: If this is checked, rkwarddev tries to select the optimal getter functions to get data from the dialog into the R code. The plugin then requires RKWard >= 0.6.0.
uk: Якщо буде позначено цей пункт, rkwarddev спробує визначити оптимальні функції отримання даних на основі діалогового вікна у коді R. Для цього потрібна версія RKWard >= 0.6.0.

source: Some consider it an enhancement for code readability if every "if" condition has an "else" clause, even if it is empty. If you check this option, the generated JS code will keep these empty "else" clauses.
uk: Деякі програмісти вважають, що для поліпшення коду слід кожну умову «if» супроводжувати відповідною інструкцією «else», навіть якщо вона буде порожньою. Якщо ви позначите цей пункт, у створеному коді JS буде збережено такі порожні інструкції «else».

source: Define how the generated code should be indented (by tabs or space characters).
uk: Тут можна визначити спосіб формування відступів у коді (за допомогою табуляцій або символів пробілу).

source: Specify where the plugin should appear in RKWard's top menus.
uk: Вкажіть, де саме має бути розміщено пункт меню додатка у системі меню RKWard.

source: You can set the exact entry name of your main component in the menu here. If left empty, the plugin name will be used as default.
uk: Тут можна вказати точну назву пункту меню основного компонента додатка. Якщо назву не буде вказано, типово буде використано назву додатка.

source: The minimum version number of RKWard required to run this plugin.
uk: Номер мінімальної версії RKWard, яку має бути встановлено для користування пакунком.

source: The maximum version number of RKWard required to run this plugin.
uk: Номер максимальної версії RKWard, яку має бути встановлено для користування цим пакунком.

source: The minimum version number of R required to run this plugin.
uk: Номер мінімальної версії R, яку має бути встановлено для користування пакунком.

source: The maximum version number of R required to run this plugin.
uk: Номер максимальної версії R, яку має бути встановлено для користування цим пакунком.

source: The names of R packages required to run this plugin.
uk: Назви пакунків R, які потрібні для роботи з цим додатком.

source: The minimum version number of R packages required to run this plugin.
uk: Номер мінімальної версії пакунків R, які має бути встановлено для користування пакунком.

source: The maximum version number of R packages required to run this plugin.
uk: Номер максимальної версії пакунків R, які має бути встановлено для користування цим пакунком.

source: The repository to download R packages from required to run this plugin.
uk: Сховище, з якого має бути отримано пакунки R, які потрібні для роботи з цим пакунком.

source: Give a short summary of the plugin for the help page. If empty, the short description is taken as the default.
uk: Надайте коротку анотацію додатка для сторінки довідки. Якщо не вказано, типово буде використано короткий опис додатка.

source: A general note on how to use the plugin.
uk: Загальні зауваження щодо користування додатком.

source: Plugin Script
uk: Скрипт додатка

source: About the plugin
uk: Про додаток

source: NOTE: You should not hit the submit button, but copy the generated code to a script file for further work on your plugin!
uk: ЗАУВАЖЕННЯ: вам не слід натискати кнопку надсилання коду, а лише скопіювати створений код до файла скрипту для подальшої роботи над вашим додатком!

source: Plugin name
uk: Назва додатка

source: License
uk: Умови ліцензування

source: Short description
uk: Короткий опис

source: Version number
uk: Номер версії

source: Release date (empty for today)
uk: Дата випуску (сьогоднішня, якщо не вказано)

source: Homepage
uk: Домашня сторінка

source: Category
uk: Категорія

source: Plugin authors
uk: Автори додатка

source: Given name
uk: Ім’я

source: Family name
uk: Прізвище

source: E-mail
uk: Ел. пошта

source: Roles
uk: Ролі

source: Author
uk: Автор

source: Maintainer
uk: Супровідник

source: Contributor
uk: Учасник розробки

source: Create options
uk: Параметри створення

source: Directory to save to (empty for $TEMPDIR)
uk: Каталог для збереження ($TEMPDIR, якщо не вказано)

source: Overwrite existing files
uk: Перезаписати наявні файли

source: Add wizard section
uk: Додати розділ майстра

source: Include plugin tests
uk: Включити тести додатка

source: Show the plugin
uk: Показати додаток

source: Open files for editing
uk: Відкрити файли для редагування

source: Add plugin to RKWard configuration
uk: Додати додаток до налаштувань RKWard

source: Guess getter functions (RKWard >= 0.6.0)
uk: Визначати функції отримання (RKWard >= 0.6.0)

source: Keep empty 'else {}'
uk: Не вилучати порожні «else {}»

source: Code indentation
uk: Відступи у коді

source: Tabs
uk: Табуляції

source: Single space
uk: Один пробіл

source: Two spaces
uk: Два пробіли

source: Four spaces
uk: Чотири пробіли

source: Place in top menu
uk: Розташувати у головному меню

source: Test (created if needed)
uk: Тест (буде створено, якщо треба)

source: File
uk: Файл

source: Edit
uk: Зміни

source: View
uk: Перегляд

source: Workspace
uk: Робочий простір

source: Run
uk: Виконання

source: Data
uk: Дані

source: Analysis
uk: Аналіз

source: Plots
uk: Креслення

source: Distributions
uk: Розподіли

source: Windows
uk: Вікна

source: Settings
uk: Параметри

source: Help
uk: Довідка

source: Name in menu (plugin name if empty)
uk: Назва пункту у меню (назва додатка, якщо не вказано)

source: Define dependencies
uk: Визначення залежностей

source: Depends on RKWard version
uk: Залежить від версії RKWard

source: RKWard min
uk: Мін. RKWard

source: RKWard max
uk: Макс. RKWard

source: Depends on R version
uk: Залежить від версії R

source: R min
uk: Мін. R

source: R max
uk: Макс. R

source: Depends on R packages
uk: Залежить від пакунків R

source: Package
uk: Пакунок

source: min
uk: мін.

source: max
uk: макс.

source: Repository
uk: Сховище

source: Help page
uk: Довідкова сторінка

source: Write help files
uk: Створити файли довідки

source: Summary
uk: Резюме

source: Usage
uk: Використання

source: export
uk: Експортувати
